app/views/home/index.html.erb

SELECT  "completed_project_images".* FROM "completed_project_images"  WHERE "completed_project_images"."completed_project_id" = $1  ORDER BY "completed_project_images"."id" ASC LIMIT 1  [["completed_project_id", 21]]
---
	    <figure class="portfolio-item effect-sadie">
        <%= image_tag(completed_project.completed_project_images.first.photo.url(:medium)) rescue image_tag("/images/medium/missing.png") %>