app/views/home/portfolio.html.erb

SELECT COUNT(*) FROM "completed_projects"  WHERE "completed_projects"."completed_project_category_id" = $1  [["completed_project_category_id", 3]]
---
		  <% @completed_project_categories.each do |completed_project_category| %>
		    <% if completed_project_category.completed_projects.count > 0 %>

SELECT  "completed_project_images".* FROM "completed_project_images"  WHERE "completed_project_images"."completed_project_id" = $1  ORDER BY "completed_project_images"."id" ASC LIMIT 1  [["completed_project_id", 14]]
---
	  <figure class="portfolio-item effect-sadie <%= completed_project.completed_project_category.id %>">
        <%= image_tag(completed_project.completed_project_images.first.photo.url(:medium)) rescue image_tag("/images/medium/missing.png") %>