app/controllers/completed_project_categories_controller.rb

  def create
    @page_title = "START::Catégories de projets terminés"
    @completed_project_category = CompletedProjectCategory.new(params[:completed_project_category])

    if @completed_project_category.save
---
INSERT INTO "completed_project_categories" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-08-11 08:09:35.006019"], ["name", "Salle de bain"], ["updated_at", "2015-08-11 08:09:35.006019"]]

  def show
    @page_title = "START::Catégories de projets terminés"
    @completed_project_categories = CompletedProjectCategory.all.order('name ASC')
---
SELECT "completed_project_categories".* FROM "completed_project_categories"   ORDER BY name ASC