app/controllers/completed_projects_controller.rb

  def new
    @page_title = "START::Projet"
    @completed_project = CompletedProject.new
    @completed_project_categories = CompletedProjectCategory.where(published: [nil, true])
---
SELECT "completed_project_categories".* FROM "completed_project_categories"  WHERE (("completed_project_categories"."published" = 't' OR "completed_project_categories"."published" IS NULL))

  def create
    @page_title = "START::Projet"
    @completed_project_categories = CompletedProjectCategory.where(published: [nil, true])
    @completed_project = CompletedProject.new(params[:completed_project])

    if @completed_project.save
      #params[:completed_project][:completed_project_images_attributes].each do |photo|
        #@completed_project.completed_project_images.create(photo)
      #end
      params[:completed_project][:completed_project_images_attributes].each do |key, array|
        @completed_project.completed_project_images.create(array)
---
SELECT "completed_project_categories".* FROM "completed_project_categories"  WHERE (("completed_project_categories"."published" = 't' OR "completed_project_categories"."published" IS NULL))
INSERT INTO "completed_projects" ("completed_project_category_id", "created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "completed_project_images" ("completed_project_id", "created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def details
    @completed_project = CompletedProject.find_by_id(params[:completed_project_id])
    @completed_projects = CompletedProject.where(published: [nil, true]).limit(6).order("created_at DESC")
---
SELECT  "completed_projects".* FROM "completed_projects"  WHERE "completed_projects"."id" = 14 LIMIT 1
SELECT  "completed_projects".* FROM "completed_projects"  WHERE (("completed_projects"."published" = 't' OR "completed_projects"."published" IS NULL))  ORDER BY created_at DESC LIMIT 6