app/controllers/contacts_controller.rb

SELECT "subjects".* FROM "subjects"  WHERE (("subjects"."published" = 't' OR "subjects"."published" IS NULL))
---
  def new
    @page_title = "START::Contacts"
    current_menu_item_class({:contact => 'current-menu-item'})

    @contact = Contact.new
    @subjects = Subject.where(published: [nil, true])

SELECT "subjects".* FROM "subjects"  WHERE (("subjects"."published" = 't' OR "subjects"."published" IS NULL))
INSERT INTO "contacts" ("created_at", "email", "message", "name", "subject_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @page_title = "START::Contacts"
    @contact = Contact.new(params[:contact])
    @subjects = Subject.where(published: [nil, true])
    current_menu_item_class({:contact => 'current-menu-item'})

    if @contact.save

SELECT "contacts".* FROM "contacts"   ORDER BY created_at DESC
---
  def show
    @page_title = "START::Contacts"
    @contacts = Contact.all.order('created_at DESC')