app/controllers/home_controller.rb

  def index
    @page_title = "START::Accueil"
    @completed_projects = CompletedProject.where(published: [nil, true]).limit(6).order("created_at DESC")
---
SELECT  "completed_projects".* FROM "completed_projects"  WHERE (("completed_projects"."published" = 't' OR "completed_projects"."published" IS NULL))  ORDER BY created_at DESC LIMIT 6

  def portfolio
    @page_title = "START::Nos-projets"
    current_menu_item_class({:projects => 'current-menu-item'})

    @completed_project_categories = CompletedProjectCategory.where(published: [nil, true]).order('name ASC')

    @completed_projects = CompletedProject.where(published: [nil, true])
---
SELECT "completed_project_categories".* FROM "completed_project_categories"  WHERE (("completed_project_categories"."published" = 't' OR "completed_project_categories"."published" IS NULL))  ORDER BY name ASC
SELECT "completed_projects".* FROM "completed_projects"  WHERE (("completed_projects"."published" = 't' OR "completed_projects"."published" IS NULL))