app/controllers/projects_controller.rb

INSERT INTO "projects" ("anything_else", "begin_date", "budget_id", "company_name", "created_at", "desired_task", "details", "email", "location", "name", "phone_number", "updated_at", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @page_title = "START::Projet"
    current_menu_item_class({:projects => 'current-menu-item'})
    @project = Project.new(params[:project].merge!({:begin_date => (Date.parse(params[:project][:begin_date]) rescue Date.today + 1.week)}))

    #if @project.save
      #@project = Project.new
      #flash.now[:success] = "Le projet a été créé"
    #else
      #flash.now[:error] = @project.errors.full_messages.map{ |msg| "#{msg}<br />" }.join
    #end

    respond_to do |format|
      if @project.save

SELECT "projects".* FROM "projects"   ORDER BY created_at ASC
---
  def show
    @page_title = "START::Projects"
    @projects = Project.all.order('created_at ASC')